In [1]:
# Installing SQLite
%pip install sqlite3

Note: you may need to restart the kernel to use updated packages.

ERROR: Could not find a version that satisfies the requirement sqlite3 (from versions: none)
ERROR: No matching distribution found for sqlite3

[notice] A new release of pip is available: 23.2.1 -> 24.0
[notice] To update, run: python.exe -m pip install --upgrade pip

In [2]:
import sqlite3
import pandas as pd

# Create your connection.
conn = sqlite3.connect('../[4] SQL Methods/sql-methods.db')
df = pd.read_sql_query("SELECT * FROM employees", conn)

# Insert Pandas code here

# Save Changes and close the connections
conn.commit()
conn.close()

df

,employee_id,first_name,last_name,department,salary,hire_date,performance_rating
0,1,John,Doe,Sales,50000,2024-04-23,3
1,2,Jane,Smith,Marketing,55000,2024-04-25,4
2,3,Michael,Johnson,Sales,60000,2024-04-26,5
3,4,Emily,Davis,Operations,62000,2024-04-27,2
4,5,David,Wilson,Operations,58000,2024-04-28,1
5,6,David,Blaine,Sales,50000,2024-03-28,2
6,7,John,Doe,Marketing,33000,2024-05-17,3